# Participant Totals Draft 1

In [1]:
import pandas as pd
import numpy as np
import sqlite3
import seaborn as sns
import matplotlib as mpl
import matplotlib.pyplot as plt
import warnings
import datetime
import matplotlib.dates as mdates

from scipy import stats
from matplotlib.dates import DateFormatter
from IPython.display import display

In [2]:
db = sqlite3.connect(
    "C:\\Users\\Space\\Documents\\py\\Projects\\TuringCollege\\TechMentalHealth\\DataSet\\mental_health.sqlite"
)

In [3]:
%matplotlib inline
pd.options.display.max_rows = 300000
pd.options.display.max_columns = 999
pd.options.display.max_colwidth = 500

In [4]:
df_totals = pd.read_sql_query(
    "SELECT DISTINCT UserID, SurveyID FROM Answer",
    db
)

df_totals = df_totals.groupby('SurveyID')['UserID'].sum().to_frame()
df_totals.rename(columns={"UserID": "Count"}, inplace=True)
df_totals

            Count
SurveyID
2014       794430
2016      2833041
2017      2322054
2018      1525386
2019      1422960

In [10]:
df_sum = df_totals.sum(numeric_only = True)
df_sum.to_frame()

             0
Count  8897871